mdepx/mdepx/arch/arm/stm/stm32n6_pwr.c
/*-
 * Copyright (c) 2025 Ruslan Bukin <br@bsdpad.com>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
 * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
 * SUCH DAMAGE.
 */

#include <sys/cdefs.h>
#include <arm/stm/stm32n6_pwr.h>

#define	RD4(_sc, _reg)		\
	*(volatile uint32_t *)((_sc)->base + _reg)
#define	WR4(_sc, _reg, _val)	\
	*(volatile uint32_t *)((_sc)->base + _reg) = _val

void
stm32n6_pwr_setup_vddio23_1v8(struct stm32n6_pwr_softc *sc)
{
	uint32_t reg;

	reg = RD4(sc, PWR_SVMCR3);
	reg |= SVMCR3_VDDIO2VRSEL;
	reg |= SVMCR3_VDDIO3VRSEL;
	reg |= SVMCR3_VDDIO2VMEN;
	reg |= SVMCR3_VDDIO3VMEN;
	WR4(sc, PWR_SVMCR3, reg);

	reg = RD4(sc, PWR_SVMCR3);
	reg |= SVMCR3_VDDIO2SV;
	reg |= SVMCR3_VDDIO3SV;
	WR4(sc, PWR_SVMCR3, reg);
}

/*
 * Mandatory for PB[9,8], PC[12:6], and PD[2].
 */
void
stm32n6_pwr_setup_vddio4_3v3(struct stm32n6_pwr_softc *sc, int enable)
{
	uint32_t reg;

	reg = RD4(sc, PWR_SVMCR1);
	if (enable)
		reg |= SVMCR1_VDDIO4SV;
	else
		reg &= ~SVMCR1_VDDIO4SV;
	WR4(sc, PWR_SVMCR1, reg);
}

int
stm32n6_pwr_init(struct stm32n6_pwr_softc *sc, uint32_t base)
{
	uint32_t reg;

	sc->base = base;

	reg = RD4(sc, PWR_CR1);
	reg &= ~CR1_LPDS08V;
	WR4(sc, PWR_CR1, reg);

	return (0);
}
